; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BLOCKS-4-2)
(:domain BLOCKS)
(:objects B D C A - block)
(:INIT (CLEAR C) (CLEAR A) (CLEAR D) (ONTABLE C) (ONTABLE B) (ONTABLE D)
 (ON A B) (HANDEMPTY))
(:goal (AND (ON C B) (ON B A) (ON A D)))
)

; plan
1. (unstack a b)
   deleted: (clear a) (handempty) (on a b)
   added: (holding a) (clear b)
   goals met: 0 of 3
2. (stack a d)
   deleted: (holding a) (clear d)
   added: (clear a) (handempty) (on a d)
   goals met: 1 of 3
3. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 1 of 3
4. (stack b a)
   deleted: (holding b) (clear a)
   added: (clear b) (handempty) (on b a)
   goals met: 2 of 3
5. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 2 of 3
6. (stack c b)
   deleted: (holding c) (clear b)
   added: (clear c) (handempty) (on c b)
   goals met: 3 of 3
